; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v5)
		(pred_1 ?v7)
		(pred_3 ?v4)
		(pred_4 ?v4)
		(pred_5 ?v7 ?v4)
		(pred_2)
		(pred_6 ?v7))

   (:action op_2
       :parameters  (?v6 ?v2)
       :precondition (and (not-eq ?v6 ?v2) 
                          (pred_3 ?v6) (pred_3 ?v2) (pred_4 ?v6))
       :effect (and  (pred_4 ?v2)
		     (not (pred_4 ?v6))))


   (:action op_3
       :parameters (?v3 ?v8)
       :precondition  (and  (pred_1 ?v3) (pred_3 ?v8)
			    (pred_5 ?v3 ?v8) (pred_4 ?v8) (pred_2))
       :effect (and (pred_6 ?v3)
		    (not (pred_5 ?v3 ?v8)) 
		    (not (pred_2))))

   (:action op_1
       :parameters  (?v3  ?v8)
       :precondition  (and  (pred_1 ?v3) (pred_3 ?v8)
			    (pred_6 ?v3) (pred_4 ?v8))
       :effect (and (pred_5 ?v3 ?v8)
		    (pred_2)
		    (not (pred_6 ?v3)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_07 obj_04 obj_02 obj_06 
          obj_03 obj_01 obj_05 
)
(:init
(pred_3 obj_07)
(pred_3 obj_04)
(pred_3 obj_02)
(pred_3 obj_06)
(pred_1 obj_03)
(pred_1 obj_01)
(pred_1 obj_05)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(pred_2)
(pred_5 obj_03 obj_06)
(pred_5 obj_01 obj_07)
(pred_5 obj_05 obj_02)
(pred_4 obj_07)
)
(:goal
(and
(pred_5 obj_03 obj_02)
(pred_5 obj_01 obj_02)
(pred_5 obj_05 obj_02)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_03 obj_02) (pred_4 obj_04))
    (sometime-before  (pred_5 obj_01 obj_02) (pred_4 obj_04))
  )
)
)

; plan
1. (op_3 obj_01 obj_07)
   deleted: (pred_5 obj_01 obj_07) (pred_2)
   added: (pred_6 obj_01)
   goals met: 1 of 3
2. (op_2 obj_07 obj_04)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_04)
   goals met: 1 of 3
3. (op_1 obj_01 obj_04)
   deleted: (pred_6 obj_01)
   added: (pred_5 obj_01 obj_04) (pred_2)
   goals met: 1 of 3
4. (op_2 obj_04 obj_06)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_06)
   goals met: 1 of 3
5. (op_3 obj_03 obj_06)
   deleted: (pred_5 obj_03 obj_06) (pred_2)
   added: (pred_6 obj_03)
   goals met: 1 of 3
6. (op_2 obj_06 obj_02)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_02)
   goals met: 1 of 3
7. (op_1 obj_03 obj_02)
   deleted: (pred_6 obj_03)
   added: (pred_5 obj_03 obj_02) (pred_2)
   goals met: 2 of 3
8. (op_2 obj_02 obj_04)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_04)
   goals met: 2 of 3
9. (op_3 obj_01 obj_04)
   deleted: (pred_5 obj_01 obj_04) (pred_2)
   added: (pred_6 obj_01)
   goals met: 2 of 3
10. (op_2 obj_04 obj_02)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_02)
   goals met: 2 of 3
11. (op_1 obj_01 obj_02)
   deleted: (pred_6 obj_01)
   added: (pred_5 obj_01 obj_02) (pred_2)
   goals met: 3 of 3
